### Terraform `plan` Succeeded for Workspace: `default`
<details open><summary>Show Output</summary>

```diff
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_iam_role.test_role has been changed
!   resource "aws_iam_role" "test_role" {
        id                    = "test_role"
        name                  = "test_role"
+       tags                  = {}
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place

Terraform will perform the following actions:

  # aws_iam_role.test_role will be updated in-place
!   resource "aws_iam_role" "test_role" {
!       assume_role_policy    = jsonencode(
!           {
!               Statement = [
                    {
                        Action    = "sts:AssumeRole"
                        Effect    = "Allow"
                        Principal = {
                            Service = "ec2.amazonaws.com"
                        }
                        Sid       = ""
                    },
+                   {
+                       Action    = "sts:AssumeRole"
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = "lambda.amazonaws.com"
                        }
+                       Sid       = ""
                    },
                ]
                # (1 unchanged element hidden)
            }
        )
        id                    = "test_role"
        name                  = "test_role"
        tags                  = {}
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.waf.aws_wafv2_web_acl.default will be created
+   resource "aws_wafv2_web_acl" "default" {
+       arn         = (known after apply)
+       capacity    = (known after apply)
+       description = "WAF acl for Cloudfront"
+       id          = (known after apply)
+       lock_token  = (known after apply)
+       name        = "default"
+       scope       = "CLOUDFRONT"
+       tags        = {
+           "Name" = "default"
        }
+       tags_all    = {
+           "Name" = "default"
        }

+       default_action {
+           allow {
            }
        }

+       rule {
+           name     = "BodySizeLimitForNormalPagesRule"
+           priority = 8

+           action {

+               block {
                }
            }

+           statement {
+               and_statement {
+                   statement {

+                       label_match_statement {
+                           key   = "awswaf:managed:aws:core-rule-set:SizeRestrictions_Body"
+                           scope = "LABEL"
                        }
                    }
+                   statement {

+                       not_statement {
+                           statement {

+                               byte_match_statement {
+                                   positional_constraint = "CONTAINS"
+                                   search_string         = "uploader"

+                                   field_to_match {

+                                       uri_path {}
                                    }

+                                   text_transformation {
+                                       priority = 0
+                                       type     = "NONE"
                                    }
                                }
                            }
                        }
                    }
                }
            }

+           visibility_config {
+               cloudwatch_metrics_enabled = false
+               metric_name                = "BodySizeLimitForNormalPagesRule"
+               sampled_requests_enabled   = true
            }
        }
+       rule {
+           name     = "BodySizeLimitForUploaderPageRule"
+           priority = 9

+           action {

+               block {
                }
            }

+           statement {

+               size_constraint_statement {
+                   comparison_operator = "GE"
+                   size                = 10000000

+                   field_to_match {

+                       body {}
                    }

+                   text_transformation {
+                       priority = 0
+                       type     = "NONE"
                    }
                }
            }

+           visibility_config {
+               cloudwatch_metrics_enabled = false
+               metric_name                = "BodySizeLimitForUploaderPageRule"
+               sampled_requests_enabled   = true
            }
        }
+       rule {
+           name     = "RateLimitRule"
+           priority = 7

+           action {

+               block {
                }
            }

+           statement {

+               rate_based_statement {
+                   aggregate_key_type = "IP"
+                   limit              = 10000
                }
            }

+           visibility_config {
+               cloudwatch_metrics_enabled = false
+               metric_name                = "RateLimitRule"
+               sampled_requests_enabled   = true
            }
        }
+       rule {
+           name     = "AWSManagedRulesAmazonIpReputationList"
+           priority = 3

+           override_action {

+               none {}
            }

+           statement {

+               managed_rule_group_statement {
+                   name        = "AWSManagedRulesAmazonIpReputationList"
+                   vendor_name = "AWS"
                }
            }

+           visibility_config {
+               cloudwatch_metrics_enabled = false
+               metric_name                = "AWSManagedRulesAmazonIpReputationList"
+               sampled_requests_enabled   = true
            }
        }
+       rule {
+           name     = "AWSManagedRulesAnonymousIpList"
+           priority = 4

+           override_action {

+               none {}
            }

+           statement {

+               managed_rule_group_statement {
+                   name        = "AWSManagedRulesAnonymousIpList"
+                   vendor_name = "AWS"
                }
            }

+           visibility_config {
+               cloudwatch_metrics_enabled = false
+               metric_name                = "AWSManagedRulesAnonymousIpList"
+               sampled_requests_enabled   = true
            }
        }
+       rule {
+           name     = "AWSManagedRulesCommonRuleSet"
+           priority = 0

+           override_action {

+               none {}
            }

+           statement {

+               managed_rule_group_statement {
+                   name        = "AWSManagedRulesCommonRuleSet"
+                   vendor_name = "AWS"

+                   excluded_rule {
+                       name = "SizeRestrictions_BODY"
                    }
                }
            }

+           visibility_config {
+               cloudwatch_metrics_enabled = false
+               metric_name                = "AWSManagedRulesCommonRuleSet"
+               sampled_requests_enabled   = true
            }
        }
+       rule {
+           name     = "AWSManagedRulesKnownBadInputsRuleSet"
+           priority = 2

+           override_action {

+               none {}
            }

+           statement {

+               managed_rule_group_statement {
+                   name        = "AWSManagedRulesKnownBadInputsRuleSet"
+                   vendor_name = "AWS"
                }
            }

+           visibility_config {
+               cloudwatch_metrics_enabled = false
+               metric_name                = "AWSManagedRulesKnownBadInputsRuleSet"
+               sampled_requests_enabled   = true
            }
        }
+       rule {
+           name     = "AWSManagedRulesLinuxRuleSet"
+           priority = 6

+           override_action {

+               none {}
            }

+           statement {

+               managed_rule_group_statement {
+                   name        = "AWSManagedRulesLinuxRuleSet"
+                   vendor_name = "AWS"
                }
            }

+           visibility_config {
+               cloudwatch_metrics_enabled = false
+               metric_name                = "AWSManagedRulesLinuxRuleSet"
+               sampled_requests_enabled   = true
            }
        }
+       rule {
+           name     = "AWSManagedRulesSQLiRuleSet"
+           priority = 1

+           override_action {

+               none {}
            }

+           statement {

+               managed_rule_group_statement {
+                   name        = "AWSManagedRulesSQLiRuleSet"
+                   vendor_name = "AWS"
                }
            }

+           visibility_config {
+               cloudwatch_metrics_enabled = false
+               metric_name                = "AWSManagedRulesSQLiRuleSet"
+               sampled_requests_enabled   = true
            }
        }
+       rule {
+           name     = "AWSManagedRulesUnixRuleSet"
+           priority = 5

+           override_action {

+               none {}
            }

+           statement {

+               managed_rule_group_statement {
+                   name        = "AWSManagedRulesUnixRuleSet"
+                   vendor_name = "AWS"
                }
            }

+           visibility_config {
+               cloudwatch_metrics_enabled = false
+               metric_name                = "AWSManagedRulesUnixRuleSet"
+               sampled_requests_enabled   = true
            }
        }

+       visibility_config {
+           cloudwatch_metrics_enabled = false
+           metric_name                = "aws_wafv2_web_acl_default"
+           sampled_requests_enabled   = true
        }
    }

Plan: 1 to add, 1 to change, 0 to destroy.
```
</details>